ArduCAM/Energia/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/dwt.xml
<module id="DWT" HW_revision=""><register id="CTRL_" width="32" offset="0x0" internal="0" description="DWT Control Register"><bitfield id="CYCCNTENA" description="Enable the CYCCNT counter" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="POSTPRESET" description="Reload value for POSTCNT, bits [8:5], post-scalar counter" begin="4" end="1" width="4" rwaccess="R/W"/><bitfield id="POSTCNT" description="Post-scalar counter for CYCTAP" begin="8" end="5" width="4" rwaccess="R/W"/><bitfield id="CYCTAP" description="Selects a tap on the DWT_CYCCNT register" begin="9" end="9" width="1" rwaccess="R/W"><bitenum id="CYCTAP__0" value="0x0" description="selects bit [6] to tap"/><bitenum id="CYCTAP__1" value="0x1" description="selects bit [10] to tap."/></bitfield><bitfield id="SYNCTAP" description="Feeds a synchronization pulse to the ITM SYNCENA control" begin="11" end="10" width="2" rwaccess="R/W"><bitenum id="SYNCTAP__0" value="0x0" description="Disabled. No synch counting."/><bitenum id="SYNCTAP__1" value="0x1" description="Tap at CYCCNT bit 24."/><bitenum id="SYNCTAP__2" value="0x2" description="Tap at CYCCNT bit 26."/><bitenum id="SYNCTAP__3" value="0x3" description="Tap at CYCCNT bit 28."/></bitfield><bitfield id="PCSAMPLEENA" description="Enables PC Sampling event" begin="12" end="12" width="1" rwaccess="R/W"><bitenum id="PCSAMPLEENA__0" value="0x0" description="PC Sampling event disabled."/><bitenum id="PCSAMPLEENA__1" value="0x1" description="Sampling event enabled."/></bitfield><bitfield id="EXCTRCENA" description="Enables Interrupt event tracing. Reset clears the EXCEVTENA bit." begin="16" end="16" width="1" rwaccess="R/W"><bitenum id="EXCTRCENA__0" value="0x0" description="interrupt event trace disabled."/><bitenum id="EXCTRCENA__1" value="0x1" description="interrupt event trace enabled."/></bitfield><bitfield id="CPIEVTENA" description="Enables CPI count event" begin="17" end="17" width="1" rwaccess="R/W"><bitenum id="CPIEVTENA__0" value="0x0" description="CPI counter events disabled."/><bitenum id="CPIEVTENA__1" value="0x1" description="CPI counter events enabled."/></bitfield><bitfield id="EXCEVTENA" description="Enables Interrupt overhead event" begin="18" end="18" width="1" rwaccess="R/W"><bitenum id="EXCEVTENA__0" value="0x0" description="Interrupt overhead event disabled."/><bitenum id="EXCEVTENA__1" value="0x1" description="Interrupt overhead event enabled."/></bitfield><bitfield id="SLEEPEVTENA" description="Enables Sleep count event" begin="19" end="19" width="1" rwaccess="R/W"><bitenum id="SLEEPEVTENA__0" value="0x0" description="Sleep count events disabled."/><bitenum id="SLEEPEVTENA__1" value="0x1" description="Sleep count events enabled."/></bitfield><bitfield id="LSUEVTENA" description="Enables LSU count event" begin="20" end="20" width="1" rwaccess="R/W"><bitenum id="LSUEVTENA__0" value="0x0" description="LSU count events disabled."/><bitenum id="LSUEVTENA__1" value="0x1" description="LSU count events enabled."/></bitfield><bitfield id="FOLDEVTENA" description="Enables Folded instruction count event" begin="21" end="21" width="1" rwaccess="R/W"><bitenum id="FOLDEVTENA__0" value="0x0" description="Folded instruction count events disabled."/><bitenum id="FOLDEVTENA__1" value="0x1" description="Folded instruction count events enabled."/></bitfield><bitfield id="CYCEVTENA" description="Enables Cycle count event" begin="22" end="22" width="1" rwaccess="R/W"><bitenum id="CYCEVTENA__0" value="0x0" description="Cycle count events disabled."/><bitenum id="CYCEVTENA__1" value="0x1" description="Cycle count events enabled."/></bitfield><bitfield id="NOPRFCNT" description="When set, DWT_FOLDCNT, DWT_LSUCNT, DWT_SLEEPCNT, DWT_EXCCNT, an" begin="24" end="24" width="1" rwaccess="R/W"/><bitfield id="NOCYCCNT" description="When set, DWT_CYCCNT is not supported." begin="25" end="25" width="1" rwaccess="R/W"/></register><register id="CYCCNT_" width="32" offset="0x4" internal="0" description="DWT Current PC Sampler Cycle Count Register"><bitfield id="CYCCNT" description="Current PC Sampler Cycle Counter count value" begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="CPICNT_" width="32" offset="0x8" internal="0" description="DWT CPI Count Register"><bitfield id="CPICNT" description="Current CPI counter value" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="EXCCNT_" width="32" offset="0xC" internal="0" description="DWT Exception Overhead Count Register"><bitfield id="EXCCNT" description="Current interrupt overhead counter value" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="SLEEPCNT_" width="32" offset="0x10" internal="0" description="DWT Sleep Count Register"><bitfield id="SLEEPCNT" description="Sleep counter" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="LSUCNT_" width="32" offset="0x14" internal="0" description="DWT LSU Count Register"><bitfield id="LSUCNT" description="LSU counter" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="FOLDCNT_" width="32" offset="0x18" internal="0" description="DWT Fold Count Register"><bitfield id="FOLDCNT" description="This counts the total number folded instructions" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="PCSR_" width="32" offset="0x1C" internal="0" description="DWT Program Counter Sample Register"><bitfield id="EIASAMPLE" description="Execution instruction address sample, or 0xFFFFFFFF if the core" begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="COMP0_" width="32" offset="0x20" internal="0" description="DWT Comparator Register 0"><bitfield id="COMP" description="Data value to compare against PC and the data address as given " begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="MASK0_" width="32" offset="0x24" internal="0" description="DWT Mask Register 0"><bitfield id="MASK" description="Mask on data address when matching against COMP" begin="3" end="0" width="4" rwaccess="R/W"/></register><register id="FUNCTION0_" width="32" offset="0x28" internal="0" description="DWT Function Register 0"><bitfield id="FUNCTION" description="Function settings" begin="3" end="0" width="4" rwaccess="R/W"><bitenum id="FUNCTION__0" value="0x0" description="Disabled"/><bitenum id="FUNCTION__1" value="0x1" description="EMITRANGE = 0, sample and emit PC through ITM"/><bitenum id="FUNCTION__2" value="0x2" description="EMITRANGE = 0, emit data through ITM on read and write"/><bitenum id="FUNCTION__3" value="0x3" description="EMITRANGE = 0, sample PC and data value through ITM on read or "/><bitenum id="FUNCTION__4" value="0x4" description="Watchpoint on PC match."/><bitenum id="FUNCTION__5" value="0x5" description="Watchpoint on read."/><bitenum id="FUNCTION__6" value="0x6" description="Watchpoint on write."/><bitenum id="FUNCTION__7" value="0x7" description="Watchpoint on read or write."/><bitenum id="FUNCTION__8" value="0x8" description="ETM trigger on PC match"/><bitenum id="FUNCTION__9" value="0x9" description="ETM trigger on read"/><bitenum id="FUNCTION__10" value="0xA" description="ETM trigger on write"/><bitenum id="FUNCTION__11" value="0xB" description="ETM trigger on read or write"/><bitenum id="FUNCTION__12" value="0xC" description="EMITRANGE = 0, sample data for read transfers"/><bitenum id="FUNCTION__13" value="0xD" description="EMITRANGE = 0, sample data for write transfers"/><bitenum id="FUNCTION__14" value="0xE" description="EMITRANGE = 0, sample PC + data for read transfers"/><bitenum id="FUNCTION__15" value="0XF" description="EMITRANGE = 0, sample PC + data for write transfers"/></bitfield><bitfield id="EMITRANGE" description="Emit range field" begin="5" end="5" width="1" rwaccess="R/W"/><bitfield id="DATAVMATCH" description="This bit is only available in comparator 1" begin="8" end="8" width="1" rwaccess="R/W"/><bitfield id="LNK1ENA" description="" begin="9" end="9" width="1" rwaccess="R/W"><bitenum id="LNK1ENA__0" value="0x0" description="DATAVADDR1 not supported"/><bitenum id="LNK1ENA__1" value="0x1" description="DATAVADDR1 supported (enabled)."/></bitfield><bitfield id="DATAVSIZE" description="Defines the size of the data in the COMP register that is to be" begin="11" end="10" width="2" rwaccess="R/W"><bitenum id="DATAVSIZE__0" value="0x0" description="byte"/><bitenum id="DATAVSIZE__1" value="0x1" description="halfword"/><bitenum id="DATAVSIZE__2" value="0x2" description="word"/><bitenum id="DATAVSIZE__3" value="0x3" description="Unpredictable."/></bitfield><bitfield id="DATAVADDR0" description="Identity of a linked address comparator for data value matching" begin="15" end="12" width="4" rwaccess="R/W"/><bitfield id="DATAVADDR1" description="Identity of a second linked address comparator for data value m" begin="19" end="16" width="4" rwaccess="R/W"/><bitfield id="MATCHED" description="This bit is set when the comparator matches, and indicates that" begin="24" end="24" width="1" rwaccess="R/W"/></register><register id="COMP1_" width="32" offset="0x30" internal="0" description="DWT Comparator Register 1"><bitfield id="COMP" description="Data value to compare against PC and the data address as given " begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="MASK1_" width="32" offset="0x34" internal="0" description="DWT Mask Register 1"><bitfield id="MASK" description="Mask on data address when matching against COMP" begin="3" end="0" width="4" rwaccess="R/W"/></register><register id="FUNCTION1_" width="32" offset="0x38" internal="0" description="DWT Function Register 1"><bitfield id="FUNCTION" description="Function settings" begin="3" end="0" width="4" rwaccess="R/W"><bitenum id="FUNCTION__0" value="0x0" description="Disabled"/><bitenum id="FUNCTION__1" value="0x1" description="EMITRANGE = 0, sample and emit PC through ITM"/><bitenum id="FUNCTION__2" value="0x2" description="EMITRANGE = 0, emit data through ITM on read and write"/><bitenum id="FUNCTION__3" value="0x3" description="EMITRANGE = 0, sample PC and data value through ITM on read or "/><bitenum id="FUNCTION__4" value="0x4" description="Watchpoint on PC match."/><bitenum id="FUNCTION__5" value="0x5" description="Watchpoint on read."/><bitenum id="FUNCTION__6" value="0x6" description="Watchpoint on write."/><bitenum id="FUNCTION__7" value="0x7" description="Watchpoint on read or write."/><bitenum id="FUNCTION__8" value="0x8" description="ETM trigger on PC match"/><bitenum id="FUNCTION__9" value="0x9" description="ETM trigger on read"/><bitenum id="FUNCTION__10" value="0xA" description="ETM trigger on write"/><bitenum id="FUNCTION__11" value="0xB" description="ETM trigger on read or write"/><bitenum id="FUNCTION__12" value="0xC" description="EMITRANGE = 0, sample data for read transfers"/><bitenum id="FUNCTION__13" value="0xD" description="EMITRANGE = 0, sample data for write transfers"/><bitenum id="FUNCTION__14" value="0xE" description="EMITRANGE = 0, sample PC + data for read transfers"/><bitenum id="FUNCTION__15" value="0XF" description="EMITRANGE = 0, sample PC + data for write transfers"/></bitfield><bitfield id="EMITRANGE" description="Emit range field" begin="5" end="5" width="1" rwaccess="R/W"/><bitfield id="CYCMATCH" description="Only available in comparator 0" begin="7" end="7" width="1" rwaccess="R/W"/><bitfield id="DATAVMATCH" description="This bit is only available in comparator 1" begin="8" end="8" width="1" rwaccess="R/W"/><bitfield id="LNK1ENA" description="" begin="9" end="9" width="1" rwaccess="R/W"><bitenum id="LNK1ENA__0" value="0x0" description="DATAVADDR1 not supported"/><bitenum id="LNK1ENA__1" value="0x1" description="DATAVADDR1 supported (enabled)."/></bitfield><bitfield id="DATAVSIZE" description="Defines the size of the data in the COMP register that is to be" begin="11" end="10" width="2" rwaccess="R/W"><bitenum id="DATAVSIZE__0" value="0x0" description="byte"/><bitenum id="DATAVSIZE__1" value="0x1" description="halfword"/><bitenum id="DATAVSIZE__2" value="0x2" description="word"/><bitenum id="DATAVSIZE__3" value="0x3" description="Unpredictable."/></bitfield><bitfield id="DATAVADDR0" description="Identity of a linked address comparator for data value matching" begin="15" end="12" width="4" rwaccess="R/W"/><bitfield id="DATAVADDR1" description="Identity of a second linked address comparator for data value m" begin="19" end="16" width="4" rwaccess="R/W"/><bitfield id="MATCHED" description="This bit is set when the comparator matches, and indicates that" begin="24" end="24" width="1" rwaccess="R/W"/></register><register id="COMP2_" width="32" offset="0x40" internal="0" description="DWT Comparator Register 2"><bitfield id="COMP" description="Data value to compare against PC and the data address as given " begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="MASK2_" width="32" offset="0x44" internal="0" description="DWT Mask Register 2"><bitfield id="MASK" description="Mask on data address when matching against COMP" begin="3" end="0" width="4" rwaccess="R/W"/></register><register id="FUNCTION2_" width="32" offset="0x48" internal="0" description="DWT Function Register 2"><bitfield id="FUNCTION" description="Function settings" begin="3" end="0" width="4" rwaccess="R/W"><bitenum id="FUNCTION__0" value="0x0" description="Disabled"/><bitenum id="FUNCTION__1" value="0x1" description="EMITRANGE = 0, sample and emit PC through ITM"/><bitenum id="FUNCTION__2" value="0x2" description="EMITRANGE = 0, emit data through ITM on read and write"/><bitenum id="FUNCTION__3" value="0x3" description="EMITRANGE = 0, sample PC and data value through ITM on read or "/><bitenum id="FUNCTION__4" value="0x4" description="Watchpoint on PC match."/><bitenum id="FUNCTION__5" value="0x5" description="Watchpoint on read."/><bitenum id="FUNCTION__6" value="0x6" description="Watchpoint on write."/><bitenum id="FUNCTION__7" value="0x7" description="Watchpoint on read or write."/><bitenum id="FUNCTION__8" value="0x8" description="ETM trigger on PC match"/><bitenum id="FUNCTION__9" value="0x9" description="ETM trigger on read"/><bitenum id="FUNCTION__10" value="0xA" description="ETM trigger on write"/><bitenum id="FUNCTION__11" value="0xB" description="ETM trigger on read or write"/><bitenum id="FUNCTION__12" value="0xC" description="EMITRANGE = 0, sample data for read transfers"/><bitenum id="FUNCTION__13" value="0xD" description="EMITRANGE = 0, sample data for write transfers"/><bitenum id="FUNCTION__14" value="0xE" description="EMITRANGE = 0, sample PC + data for read transfers"/><bitenum id="FUNCTION__15" value="0XF" description="EMITRANGE = 0, sample PC + data for write transfers"/></bitfield><bitfield id="EMITRANGE" description="Emit range field" begin="5" end="5" width="1" rwaccess="R/W"/><bitfield id="DATAVMATCH" description="This bit is only available in comparator 1" begin="8" end="8" width="1" rwaccess="R/W"/><bitfield id="LNK1ENA" description="" begin="9" end="9" width="1" rwaccess="R/W"><bitenum id="LNK1ENA__0" value="0x0" description="DATAVADDR1 not supported"/><bitenum id="LNK1ENA__1" value="0x1" description="DATAVADDR1 supported (enabled)."/></bitfield><bitfield id="DATAVSIZE" description="Defines the size of the data in the COMP register that is to be" begin="11" end="10" width="2" rwaccess="R/W"><bitenum id="DATAVSIZE__0" value="0x0" description="byte"/><bitenum id="DATAVSIZE__1" value="0x1" description="halfword"/><bitenum id="DATAVSIZE__2" value="0x2" description="word"/><bitenum id="DATAVSIZE__3" value="0x3" description="Unpredictable."/></bitfield><bitfield id="DATAVADDR0" description="Identity of a linked address comparator for data value matching" begin="15" end="12" width="4" rwaccess="R/W"/><bitfield id="DATAVADDR1" description="Identity of a second linked address comparator for data value m" begin="19" end="16" width="4" rwaccess="R/W"/><bitfield id="MATCHED" description="This bit is set when the comparator matches, and indicates that" begin="24" end="24" width="1" rwaccess="R/W"/></register><register id="COMP3_" width="32" offset="0x50" internal="0" description="DWT Comparator Register 3"><bitfield id="COMP" description="Data value to compare against PC and the data address as given " begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="MASK3_" width="32" offset="0x54" internal="0" description="DWT Mask Register 3"><bitfield id="MASK" description="Mask on data address when matching against COMP" begin="3" end="0" width="4" rwaccess="R/W"/></register><register id="FUNCTION3_" width="32" offset="0x58" internal="0" description="DWT Function Register 3"><bitfield id="FUNCTION" description="Function settings" begin="3" end="0" width="4" rwaccess="R/W"><bitenum id="FUNCTION__0" value="0x0" description="Disabled"/><bitenum id="FUNCTION__1" value="0x1" description="EMITRANGE = 0, sample and emit PC through ITM"/><bitenum id="FUNCTION__2" value="0x2" description="EMITRANGE = 0, emit data through ITM on read and write"/><bitenum id="FUNCTION__3" value="0x3" description="EMITRANGE = 0, sample PC and data value through ITM on read or "/><bitenum id="FUNCTION__4" value="0x4" description="Watchpoint on PC match."/><bitenum id="FUNCTION__5" value="0x5" description="Watchpoint on read."/><bitenum id="FUNCTION__6" value="0x6" description="Watchpoint on write."/><bitenum id="FUNCTION__7" value="0x7" description="Watchpoint on read or write."/><bitenum id="FUNCTION__8" value="0x8" description="ETM trigger on PC match"/><bitenum id="FUNCTION__9" value="0x9" description="ETM trigger on read"/><bitenum id="FUNCTION__10" value="0xA" description="ETM trigger on write"/><bitenum id="FUNCTION__11" value="0xB" description="ETM trigger on read or write"/><bitenum id="FUNCTION__12" value="0xC" description="EMITRANGE = 0, sample data for read transfers"/><bitenum id="FUNCTION__13" value="0xD" description="EMITRANGE = 0, sample data for write transfers"/><bitenum id="FUNCTION__14" value="0xE" description="EMITRANGE = 0, sample PC + data for read transfers"/><bitenum id="FUNCTION__15" value="0XF" description="EMITRANGE = 0, sample PC + data for write transfers"/></bitfield><bitfield id="EMITRANGE" description="Emit range field" begin="5" end="5" width="1" rwaccess="R/W"/><bitfield id="DATAVMATCH" description="This bit is only available in comparator 1" begin="8" end="8" width="1" rwaccess="R/W"/><bitfield id="LNK1ENA" description="" begin="9" end="9" width="1" rwaccess="R/W"><bitenum id="LNK1ENA__0" value="0x0" description="DATAVADDR1 not supported"/><bitenum id="LNK1ENA__1" value="0x1" description="DATAVADDR1 supported (enabled)."/></bitfield><bitfield id="DATAVSIZE" description="Defines the size of the data in the COMP register that is to be" begin="11" end="10" width="2" rwaccess="R/W"><bitenum id="DATAVSIZE__0" value="0x0" description="byte"/><bitenum id="DATAVSIZE__1" value="0x1" description="halfword"/><bitenum id="DATAVSIZE__2" value="0x2" description="word"/><bitenum id="DATAVSIZE__3" value="0x3" description="Unpredictable."/></bitfield><bitfield id="DATAVADDR0" description="Identity of a linked address comparator for data value matching" begin="15" end="12" width="4" rwaccess="R/W"/><bitfield id="DATAVADDR1" description="Identity of a second linked address comparator for data value m" begin="19" end="16" width="4" rwaccess="R/W"/><bitfield id="MATCHED" description="This bit is set when the comparator matches, and indicates that" begin="24" end="24" width="1" rwaccess="R/W"/></register></module>